{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"args_0": {"name": "args_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "16000"}]}}}, "outputs": {"identity_24": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_24/tf.reshape_81/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_89/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_105/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_106/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_107/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_90/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_82/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/dense_70/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16000"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/dense_70/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/dense_71/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/dense_71/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_83/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.math.reduce_mean_24/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "args_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "16000"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.shape_32/Shape", "op": "Shape", "input": ["args_0"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_24/tf.unstack_8/unstack", "op": "Unpack", "input": ["StatefulPartitionedCall/model_24/tf.compat.v1.shape_32/Shape"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "num": {"i": "3"}}}, {"name": "StatefulPartitionedCall/model_24/tf.math.multiply_8/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_24/tf.unstack_8/unstack", "StatefulPartitionedCall/model_24/tf.unstack_8/unstack:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_83/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_24/tf.unstack_8/unstack", "StatefulPartitionedCall/model_24/tf.unstack_8/unstack:1", "StatefulPartitionedCall/model_24/tf.reshape_83/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_81/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_24/tf.math.multiply_8/Mul", "StatefulPartitionedCall/model_24/tf.reshape_81/Reshape/shape/1", "StatefulPartitionedCall/model_24/tf.unstack_8/unstack:2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_81/Reshape", "op": "Reshape", "input": ["args_0", "StatefulPartitionedCall/model_24/tf.reshape_81/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_89/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model_24/tf.reshape_81/Reshape", "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_89/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_105/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_24/tf.compat.v1.transpose_89/transpose", "StatefulPartitionedCall/model_24/zero_padding1d_105/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_24/zero_padding1d_105/Pad", "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims", "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims_1", "StatefulPartitionedCall/model_24/depthwise_conv1d_35/BiasAdd/ReadVariableOp"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_24/depthwise_conv1d_35/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model_24/re_lu_140/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_24/depthwise_conv1d_35/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_24/re_lu_140/Relu", "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_106/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/Squeeze", "StatefulPartitionedCall/model_24/zero_padding1d_106/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_24/zero_padding1d_106/Pad", "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims", "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims_1", "StatefulPartitionedCall/model_24/conv1d_70/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_24/conv1d_70/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/model_24/re_lu_141/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_24/conv1d_70/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_24/re_lu_141/Relu", "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/ExpandDims"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_107/Pad", "op": "Pad", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/Squeeze", "StatefulPartitionedCall/model_24/zero_padding1d_107/Pad/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_24/zero_padding1d_107/Pad", "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/Conv1D", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims", "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims_1", "StatefulPartitionedCall/model_24/conv1d_71/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_24/conv1d_71/Conv1D"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/model_24/re_lu_142/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/model_24/conv1d_71/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model_24/re_lu_142/Relu", "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d", "op": "MaxPool", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/ExpandDims"], "attr": {"ksize": {"list": {"i": ["1", "1", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_90/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/Squeeze", "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_90/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.shape_33/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_24/tf.compat.v1.transpose_90/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_24/tf.compat.v1.shape_33/Shape", "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack", "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack_1", "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice", "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack", "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack_1", "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_82/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice", "StatefulPartitionedCall/model_24/tf.reshape_82/Reshape/shape/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_82/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_24/tf.compat.v1.transpose_90/transpose", "StatefulPartitionedCall/model_24/tf.reshape_82/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/re_lu_143/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_24/tf.reshape_82/Reshape", "StatefulPartitionedCall/model_24/dense_70/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_24/dense_70/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/dense_71/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_24/re_lu_143/Relu", "StatefulPartitionedCall/model_24/dense_71/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_24/dense_71/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_83/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_24/dense_71/BiasAdd", "StatefulPartitionedCall/model_24/tf.reshape_83/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_24/tf.math.reduce_mean_24/Mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_24/tf.reshape_83/Reshape", "StatefulPartitionedCall/model_24/tf.math.reduce_mean_24/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_24/tf.math.reduce_mean_24/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "StatefulPartitionedCall/model_24/tf.reshape_81/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_89/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_105/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/ExpandDims_1", "shape": [1, 5, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/depthwise_conv1d_35/BiasAdd/ReadVariableOp", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_74/MaxPool1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_106/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/Conv1D/ExpandDims_1", "shape": [1, 5, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/conv1d_70/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_75/MaxPool1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/zero_padding1d_107/Pad/paddings", "shape": [3, 2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/Conv1D/ExpandDims_1", "shape": [1, 5, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/conv1d_71/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/tf.nn.max_pool1d_76/MaxPool1d/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.compat.v1.transpose_90/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_72/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.__operators__.getitem_74/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_82/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/dense_70/MatMul/ReadVariableOp", "shape": [16000, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/dense_70/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/dense_71/MatMul/ReadVariableOp", "shape": [256, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/dense_71/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_24/tf.reshape_83/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_24/tf.math.reduce_mean_24/Mean/reduction_indices", "shape": [1], "dtype": "int32"}]}]}